//
//  MarketDataModel.swift
//  CryptoApp
//
//  Created by Никита Котов on 22.09.2023.
//

import Foundation

// JSON Data
/*
    url:
        https://api.coingecko.com/api/v3/global
 
    JSON Response
 
 {
   "data": {
     "active_cryptocurrencies": 10105,
     "upcoming_icos": 0,
     "ongoing_icos": 49,
     "ended_icos": 3376,
     "markets": 865,
     "total_market_cap": {
       "btc": 41101197.22753116,
       "eth": 687310340.730809,
       "ltc": 16910380386.778177,
       "bch": 5251146790.709569,
       "bnb": 5182441262.738201,
       "eos": 1903196991320.7617,
       "xrp": 2138628786358.9358,
       "xlm": 9505347349017.707,
       "link": 164630125626.7176,
       "dot": 272356614398.4245,
       "yfi": 214429621.8543312,
       "usd": 1094500571125.5627,
       "aed": 4020007565195.648,
       "ars": 383098950556340.75,
       "aud": 1702575536927.5059,
       "bdt": 120043349443283.2,
       "bhd": 412637660320.0506,
       "bmd": 1094500571125.5627,
       "brl": 5403222063976.155,
       "cad": 1473625718458.3174,
       "chf": 989783134482.5557,
       "clp": 973799048141836.8,
       "cny": 7991605370130.417,
       "czk": 25097226446080.49,
       "dkk": 7657185098625.265,
       "eur": 1027079335944.2303,
       "gbp": 890681580269.991,
       "hkd": 8558283040830.693,
       "huf": 398215357340791.25,
       "idr": 16827746991108064,
       "ils": 4178146480214.7446,
       "inr": 90741213789022.52,
       "jpy": 161931906748312.6,
       "krw": 1461889960163437,
       "kwd": 338079186914.40424,
       "lkr": 356323435541005.94,
       "mmk": 2296983697375922,
       "mxn": 18827236544812.906,
       "myr": 5131565927722.224,
       "ngn": 843050009915176.5,
       "nok": 11777285835550.932,
       "nzd": 1842996676701.2012,
       "php": 62153588903103.97,
       "pkr": 316524704492476.4,
       "pln": 4736305652969.912,
       "rub": 105251544165713.9,
       "sar": 4105291049697.7534,
       "sek": 12227094924267.531,
       "sgd": 1495202702717.4875,
       "thb": 39643357936453.46,
       "try": 29697482394557.812,
       "twd": 35196728277140.49,
       "uah": 40395383806370.97,
       "vef": 109592342186.8028,
       "vnd": 26618253889773720,
       "zar": 20676313172186.69,
       "xdr": 829393926289.2426,
       "xag": 46466726231.98147,
       "xau": 568702496.756844,
       "bits": 41101197227531.16,
       "sats": 4110119722753115.5
     },
     "total_volume": {
       "btc": 2479699.095363337,
       "eth": 41466500.85906581,
       "ltc": 1020229525.5588241,
       "bch": 316809845.5735607,
       "bnb": 312664734.3104041,
       "eos": 114822831839.92296,
       "xrp": 129026797869.04083,
       "xlm": 573472375804.3024,
       "link": 9932391295.713253,
       "dot": 16431697758.127853,
       "yfi": 12936872.285927488,
       "usd": 66032920186.489136,
       "aed": 242533303046.75888,
       "ars": 23112954979639.27,
       "aud": 102719027753.25752,
       "bdt": 7242401805743.571,
       "bhd": 24895071239.508404,
       "bmd": 66032920186.489136,
       "brl": 325984783117.56226,
       "cad": 88906129442.8073,
       "chf": 59715154514.72674,
       "clp": 58750809748323.19,
       "cny": 482145970033.6696,
       "czk": 1514154669752.2517,
       "dkk": 461969875402.3673,
       "eur": 61965292303.00155,
       "gbp": 53736203756.44105,
       "hkd": 516334514460.22534,
       "huf": 24024951290136.953,
       "idr": 1015244124395066,
       "ils": 252074069519.90494,
       "inr": 5474558429506.997,
       "jpy": 9769603558051.162,
       "krw": 88198092908831.97,
       "kwd": 20396842683.484463,
       "lkr": 21497546552632.69,
       "mmk": 138580595716373.02,
       "mxn": 1135876436151.4058,
       "myr": 309595346294.3557,
       "ngn": 50862517102845.16,
       "nok": 710541955033.1017,
       "nzd": 111190853314.42346,
       "php": 3749822598193.6772,
       "pkr": 19096427265734.11,
       "pln": 285748679728.6469,
       "rub": 6349989208550.172,
       "sar": 247678588187.6902,
       "sek": 737679636307.9827,
       "sgd": 90207902431.36378,
       "thb": 2391745385614.7305,
       "try": 1791695259402.9597,
       "twd": 2123473308707.2407,
       "uah": 2437116274910.266,
       "vef": 6611876298.2731695,
       "vnd": 1605920618935418,
       "zar": 1247434102337.4639,
       "xdr": 50038624357.678314,
       "xag": 2803409797.62894,
       "xau": 34310705.32889985,
       "bits": 2479699095363.337,
       "sats": 247969909536333.72
     },
     "market_cap_percentage": {
       "btc": 47.42568663411868,
       "eth": 17.4941491873793,
       "usdt": 7.598580736214903,
       "bnb": 2.9667583668041457,
       "xrp": 2.492369350905151,
       "usdc": 2.3551623177432894,
       "steth": 1.2669364824769946,
       "doge": 0.7934780568795665,
       "ada": 0.7867215117317016,
       "sol": 0.7419636726239286
     },
     "market_cap_change_percentage_24h_usd": -1.5926642751973503,
     "updated_at": 1695360063
   }
 }

 */

struct GlobalData: Codable {
    let data: MarketDataModel?
}

struct MarketDataModel: Codable {
    let totalMarketCap, totalVolume, marketCapPercentage: [String: Double]
    let marketCapChangePercentage24HUsd: Double
    
    enum CodingKeys: String, CodingKey {
        case totalMarketCap = "total_market_cap"
        case totalVolume = "total_volume"
        case marketCapPercentage = "market_cap_percentage"
        case marketCapChangePercentage24HUsd = "market_cap_change_percentage_24h_usd"
    }
    
    var marketCap: String {
        if let item = totalMarketCap.first(where: { $0.key == "usd" }) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        
        return ""
    }
    
    var volume: String {
        if let item = totalVolume.first(where: { $0.key == "usd" }) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        
        return ""
    }
    
    var btcDominance: String {
        if let item = marketCapPercentage.first(where: { $0.key == "btc" }) {
            return item.value.asPercentString()
        }
        
        return ""
    }
}

